# SlabShapeVertex Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
SlabShapeVertex Class
Members See Also
---
A vertex used in Slab Shape Editing.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class SlabShapeVertex
```

Visual Basic
---
```text
Public Class SlabShapeVertex
```

Visual C++
---
```text
public ref class SlabShapeVertex
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..SlabShapeVertex
# See Also
SlabShapeVertex Members
Autodesk.Revit.DB Namespace